export const TERMS_1 = `이용 약관

1. STILE 을 이용해 주셔서 감사합니다.
  이 이용약관은 사이트를 사용함에 있어 사용자(이하 "회원"이라 함)와 사이트 운영자(이하 "사이트 관리자"라 함) 간의 권리와 의무를 규정합니다.

2. 회원 가입 및 계정
  2.1 회원은 사이트에서 제공하는 가입 양식을 작성하여 회원 가입을 신청할 수 있습니다.

  2.2 회원은 개인정보를 정확하게 제공해야 하며, 이용자 정보의 변경이 있는 경우 즉시 갱신해야 합니다.

  2.3 회원은 자신의 계정 정보를 안전하게 보호해야 하며, 계정 정보 유출로 인한 문제에 대한 책임은 회원 본인에게 있습니다.

3. 서비스 이용
  3.1 회원은 사이트를 이용하여 벽지 관련 정보를 검색하고 게시물을 작성할 수 있습니다.

  3.2 회원은 다른 회원의 개인 정보를 무단으로 수집하거나 악용해서는 안 됩니다.

  3.3 회원은 사이트 내에서 적절한 예의와 배려를 갖춰야 하며, 부적절한 내용이나 행동을 금지합니다.

4. 게시물의 권리와 책임
  4.1 회원이 사이트에 게시한 내용물에 대한 권리와 책임은 해당 회원에게 있습니다.

  4.2 회원이 게시한 내용으로 인해 발생하는 법적 책임은 해당 회원이 부담합니다.

5. 서비스 변경 및 중단 사이트 관리자는 사전 고지 후 사이트의 일부 또는 전체 서비스를 변경하거나 중단할 수 있습니다.

6. 소유권 및 지적 재산권
  6.1 사이트 내에 게시된 콘텐츠의 저작권과 지적 재산권은 사이트 또는 해당 콘텐츠의 제공자에게 귀속됩니다.

  6.2 회원은 사이트를 통해 얻은 정보를 상업적으로 이용하거나 제3자에게 제공하는 행위를 금지합니다.

7. 면책 및 책임 제한 사이트 관리자는 회원 간 또는 회원과 제3자 간의 행위에 대해 책임을 지지 않습니다.

8. 이용 약관의 변경 이용 약관은 사이트 관리자의 사전 고지 없이 변경될 수 있으며, 변경된 내용은 사이트 내에서 확인할 수 있습니다.

9. 연락처 이용 약관에 관한 문의나 불만은 사이트 관리자에게 연락해 주세요.
`;

const nowDate = new Date();
export const TERMS_2 = `개인정보 수집 및 이용동의 약관

  본 약관은 회사(이하 "당사")가 제공하는 서비스 이용과 관련하여 개인정보 수집 및 이용에 대한 동의 사항을 규정합니다.
  이 약관에 동의함으로써 당사는 귀하의 개인정보를 아래와 같이 수집 및 이용할 수 있습니다.
1. 수집하는 개인정보의 항목 및 수집방법

  1.1 수집하는 개인정보의 항목 당사는 서비스 제공을 위해 아래와 같은 개인정보를 수집할 수 있습니다.
    - 연락처 (전화번호, 이메일 등)
    - 기타 서비스 이용에 필요한 정보

  1.2 개인정보 수집방법 당사는 다음과 같은 방법으로 개인정보를 수집합니다.
    - 홈페이지, 모바일 앱 등을 통한 회원가입
    - 이벤트, 설문조사 등의 참여
    - 서비스 이용 과정에서 자동으로 생성되는 정보 (접속 로그, 쿠키 등)
    - 공공기관, 제3자 기업 등으로부터의 정보 제공

2. 개인정보의 수집 및 이용 목적
  당사는 수집한 개인정보를 다음과 같은 목적으로 이용합니다.
    - 회원 가입 및 관리
    - 서비스 제공, 운영 및 개선
    - 상품 및 이벤트 안내
    - 문의사항 또는 불만 처리
    - 법령 및 회원약관에 따른 의무 이행
    - 마케팅 및 광고 활용

3. 개인정보의 보유 및 이용 기간
  개인정보는 수집 및 이용목적이 달성된 후에는 지체 없이 파기됩니다. 다만, 관련 법령에 의거하여 보존할 필요가 있는 경우에는 그에 따릅니다.

4. 개인정보의 제3자 제공
  당사는 귀하의 개인정보를 본 약관에 명시된 범위를 초과하여 제3자에게 제공하지 않습니다. 단, 아래의 경우에는 예외로 합니다.
    - 귀하가 사전에 동의한 경우
    - 법령에 의해 요구되는 경우
    - 법적인 절차에 따라 요청이 있는 경우

5. 권리의 행사
  귀하는 개인정보에 대한 열람, 정정, 삭제, 처리정지 등의 권리를 행사할 수 있으며, 이와 관련된 문의 및 요청은 아래 연락처로 문의하시기 바랍니다.
    - 이메일: privacy@company.com
    - 전화번호: 123-4567-8901

6. 개인정보의 안전성 보장
  당사는 개인정보보호를 위해 기술적, 관리적, 물리적 보호조치를 강구하며, 개인정보의 분실, 도난, 누출, 변조 등을 방지하기 위한 최선의 노력을 다하고 있습니다.

  본 약관은 귀하와 당사 간의 서비스 이용과 관련한 개인정보 수집 및 이용에 대한 내용을 규정하고 있습니다.
  본 약관에 동의하시면 당사의 개인정보 처리에 동의하는 것으로 간주됩니다.
  본 약관에 동의합니다.
  - ${nowDate.getFullYear()}년 ${nowDate.getMonth() + 1}월 ${nowDate.getDate()}일
`;
